"""
Задача 1
Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
"""
print("Задача 2_________________________________")
for i in range(5):
    print(i+1, "_", "0000")
print("_________________________________________")
print()